
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  image_data_param {
    source: "lfw_list.txt"
    batch_size: 64
    new_height: 64
    new_width: 64
    shuffle:true
  }
}
